Revit 2027 API
ViewSchedule.IsSplit Method
 Checks if the schedule is split.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsSplit()
Public Function IsSplit As Boolean
public:
bool IsSplit()
member IsSplit : unit -> bool
Return Value
Boolean
 True if the schedule is split. Otherwise false.
See Also
Reference
ViewSchedule Class
Autodesk.Revit.DB Namespace